pub fn 读取异常类型() -> 异常类型 {
    let 触发异常原因代码: usize;
    unsafe {
        core::arch::asm!("csrr {}, scause", out(reg) 触发异常原因代码);
    }
    if 触发异常原因代码 >> 63 == 1 {
        异常类型::中断(中断类型::解析(触发异常原因代码 & 0xf))
    } else {
        异常类型::解析(触发异常原因代码)
    }
}

pub enum 异常类型 {
    用户系统调用,
    存储错误,
    存储页错误,
    非法指令,
    中断(中断类型),
    其它
}

impl 异常类型 {
    fn 解析(触发异常原因代码: usize) -> Self {
        match 触发异常原因代码 {
            2 => 异常类型::非法指令,
            7 => 异常类型::存储错误,
            15 => 异常类型::存储页错误,
            8 => 异常类型::用户系统调用,
            _ => 异常类型::其它
        }
    }
}

pub enum 中断类型 {
    时钟中断,
    其它
}

impl 中断类型 {
    pub fn 解析(触发异常原因代码: usize) -> Self {
        match 触发异常原因代码 {
            5 => 中断类型::时钟中断,
            _ => 中断类型::其它
        }
    }
}